app/views/admin/journal_issue_comment/_all_comment.html.erb

<%= label_tag :comment, "Comments" %>
<% @admin_journal_issue.journal_issue_comments.each do |comment| %>
---
SELECT "admin_journal_issue_comments".* FROM "admin_journal_issue_comments" WHERE "admin_journal_issue_comments"."journal_issue_id" = $1  [["journal_issue_id", 12]]