app/views/admin/categories/shared/_index.html.erb

		<td>
			<% admin_category.sub_categories.each do |category| %>
---
SELECT "admin_sub_categories".* FROM "admin_sub_categories" WHERE "admin_sub_categories"."category_id" = $1  [["category_id", 2]]