app/controllers/admin/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY created_at DESC LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM "articles"
SELECT "articles".* FROM "articles"
---
  def index
    @articles = Article.order("created_at DESC").paginate(:page => params[:page], :per_page => 6)
    @articles_all = Article.all

INSERT INTO "articles" ("admin_id", "body", "category_id", "created_at", "is_delete", "is_edit", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "admins".* FROM "admins" WHERE "admins"."id" = 3 ORDER BY "admins"."id" ASC LIMIT 1
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "articles" SET "sub_category_id" = $1, "updated_at" = $2 WHERE "articles"."id" = 5  [["sub_category_id", 2], ["updated_at", Sat, 22 Aug 2015 11:49:13 UTC +00:00]]
---
  def create
    @article = Article.new(article_params)
    @article.admin_id = current_admin.id
    respond_to do |format|
      if @article.save
        unless params[:article][:photo].blank?
          preloaded = Cloudinary::Uploader.upload(params[:article][:photo], :use_filename => true, :public_id => "articles/#{@article.id}")
          rand = RandCloud.generated_rand("articles",@article.id,"/v2#{Random.rand(11)}")
        end
        sub_category = Article.find(@article.id)
        sub_category.update_attributes(sub_category_id: params[:sub_category])

SELECT "articles".* FROM "articles" WHERE (category_id = 1) AND (sub_category_id = 2) LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "articles" WHERE (category_id = 1) AND (sub_category_id = 2)
---
  def article_search
    articles = Article.search_by_params(params)
    @articles = articles.paginate(:page => params[:page], :per_page => 20)

SELECT "admin_sub_categories".* FROM "admin_sub_categories" WHERE (category_id = '1')
SELECT "admins".* FROM "admins" WHERE "admins"."id" = 3 ORDER BY "admins"."id" ASC LIMIT 1
---
  def auto_search
    unless params[:category].blank?
      sub_category = Admin::SubCategory.where("category_id = ?", params[:category])