app/controllers/admin/categories_controller.rb

    def set_admin_category
      @admin_category = Admin::Category.find(params[:id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = 3 ORDER BY "admins"."id" ASC LIMIT 1

    def set_admin_sub_category
      @category_count = Admin::SubCategory.all.count
---
SELECT "admin_sub_categories".* FROM "admin_sub_categories" WHERE "admin_sub_categories"."category_id" = $1  [["category_id", 2]]