app/controllers/admin/galleries_controller.rb

  def index
    @group = Admin::GalleryGroup.find(params[:group_id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = 3 ORDER BY "admins"."id" ASC LIMIT 1

  def new
    @admin_gallery = Admin::Gallery.new
    @group = Admin::GalleryGroup.find(params[:id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = 3 ORDER BY "admins"."id" ASC LIMIT 1