app/controllers/admin/journal_issues_controller.rb

    def set_admin_journal_issue
      @admin_journal_issue = Admin::JournalIssue.find(params[:id])
---
SELECT "admin_journal_issues".* FROM "admin_journal_issues" WHERE "admin_journal_issues"."id" = $1 LIMIT 1  [["id", "12"]]
SELECT "admins".* FROM "admins" WHERE "admins"."id" = 3 ORDER BY "admins"."id" ASC LIMIT 1

    def set_select_project
       admin_journals = Admin::Journal.order("admin_journals.created_at DESC").is_allowed(params[:admin_id].blank? ? session[:session_admin] : params[:admin_id],nil)
---
SELECT "admin_journals".* FROM "admin_journals" ORDER BY created_at DESC

    def set_admin_journal
      unless params[:id].blank?
        @admin_journal = Admin::Journal.find(@admin_journal_issue.journal_id)
        @assign = Admin::JournalIssue.assign(@admin_journal_issue.journal_id).map { |x| ["#{x.name} #{x.last_name}",x.admin_id] }.unshift(['Select',nil])
      else
        @admin_journal = Admin::Journal.find(params[:id_journal].blank? ? params[:admin_journal_issue][:journal_id] : params[:id_journal])
        @assign = Admin::JournalIssue.assign(params[:id_journal].blank? ? params[:admin_journal_issue][:journal_id] : params[:id_journal]).map { |x| ["#{x.name} #{x.last_name}",x.admin_id] }.unshift(['Select',nil])
      end
      @status = Admin::StatusJournal.all.map { |x| [x.name,x.id] }.unshift(['Select Status',nil])
      @type = Admin::TypeJournal.all.map { |x| [x.name,x.id] }.unshift(['Select Type',nil])
---
SELECT "admin_journal_issues".* FROM "admin_journal_issues" ORDER BY "admin_journal_issues"."id" DESC LIMIT 1
SELECT "admin_status_journals".* FROM "admin_status_journals" WHERE (id != 5)
SELECT "admin_type_journals".* FROM "admin_type_journals"

    def set_selected
      @assigned = @admin_journal_issue.asignee
      @statused = @admin_journal_issue.status_id
      @priorited = @admin_journal_issue.priority
      @typed = @admin_journal_issue.type_id
      @progressed = @admin_journal_issue.progress
      @selected_assign = Admin::JournalIssueAsignee.where("journal_issue_id = #{@admin_journal_issue.id}")
---
SELECT "admin_journal_issue_asignees".* FROM "admin_journal_issue_asignees" WHERE "admin_journal_issue_asignees"."journal_issue_id" = $1  [["journal_issue_id", 12]]

    def set_filter
      @admins = Admin::Profile.all.map{|x|["#{x.name} #{x.last_name}", x.admin_id]}.unshift(['Select',nil])
      project = []
      admin_journals = Admin::Journal.order("admin_journals.created_at DESC").is_allowed(session[:session_admin],nil)
      admin_journals.each do |journal|
        project << [journal.title,journal.id]
      end
      @project = project.unshift(['Select',nil])
      unless params[:journal_issue_id].blank?
        status = []
        status << Admin::StatusJournal.find(params[:journal_issue_id])
---
SELECT "admin_status_journals".* FROM "admin_status_journals" WHERE "admin_status_journals"."id" = $1 LIMIT 1  [["id", 1]]