app/controllers/admin/journals_controller.rb

  def index
    @admin_journals = Admin::Journal.order("admin_journals.created_at DESC").paginate(:page => params[:page], :per_page => 20).is_allowed(session[:session_admin],nil)
---
SELECT "admin_journals".* FROM "admin_journals" ORDER BY created_at DESC

  def show
    @admin_journals = []
    @admin_journals << @admin_journal
    params = {"project" => @admin_journal.id}
    find_admin = Admin.find(session[:session_admin])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = 3 ORDER BY "admins"."id" ASC LIMIT 1

    def set_admin_journal
      unless params[:id] == "add_global_row"
          @admin_journal = Admin::Journal.find(params[:id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = 3 ORDER BY "admins"."id" ASC LIMIT 1

    def set_admin_journal_team
      @selected_designer = Admin::JornalTeamDesigner.where("journal_id = ? ",params[:id])
      @selected_developer = Admin::JournalTeamDeveloper.where("journal_id = ? ",params[:id])
      @selected_check = Admin::JournalTeamCheck.where("journal_id = ? ",params[:id])
---
SELECT "admin_jornal_team_designers".* FROM "admin_jornal_team_designers" WHERE "admin_jornal_team_designers"."journal_id" = $1  [["journal_id", 36]]
SELECT "admin_journal_team_developers".* FROM "admin_journal_team_developers" WHERE "admin_journal_team_developers"."journal_id" = $1  [["journal_id", 36]]
SELECT "admin_journal_team_checks".* FROM "admin_journal_team_checks" WHERE "admin_journal_team_checks"."journal_id" = $1  [["journal_id", 36]]

    def set_select
      main = Admin::StatusJournal.where("id = 5")
      sub_main = Admin::StatusJournal.find(6)
      @status = main.map { |x| [x.name,x.id] }.unshift([sub_main.name,sub_main.id])
---
SELECT "admin_status_journals".* FROM "admin_status_journals" WHERE "admin_status_journals"."id" = $1 LIMIT 1  [["id", 5]]
SELECT "admin_status_journals".* FROM "admin_status_journals"

    def set_filter
      project = []
      admin_journals = Admin::Journal.order("admin_journals.created_at DESC").is_allowed(session[:session_admin],nil)
---
SELECT "admin_journals".* FROM "admin_journals" ORDER BY created_at DESC