app/controllers/admin/profiles_controller.rb

SELECT "admin_profile_skills".* FROM "admin_profile_skills" WHERE "admin_profile_skills"."profile_id" = 3
---
  def edit
    @admin_skills = Admin::ProfileSkill.find_all_by_profile_id(params[:id])

UPDATE "admin_profiles" SET "name" = $1, "skype" = $2, "updated_at" = $3 WHERE "admin_profiles"."id" = 5  [["name", "Upit"], ["skype", ""], ["updated_at", Sat, 22 Aug 2015 11:56:47 UTC +00:00]]
SELECT "admin_profiles".* FROM "admin_profiles" WHERE "admin_profiles"."id" = $1 LIMIT 1  [["id", "3"]]
SELECT "admins".* FROM "admins" WHERE "admins"."id" = 3 ORDER BY "admins"."id" ASC LIMIT 1
---
  def update
    unless session[:session_admin].present?
      session[:session_admin] = current_admin.id
    end
    @not_current = 'no'
    @tab = params[:tab]
    respond_to do |format|
      if @admin_profile.update(admin_profile_params)
        Admin.find(current_admin.id).update_attributes(email: params[:admin_profile][:e_mail])

SELECT "admins".* FROM "admins" WHERE "admins"."id" = 3 ORDER BY "admins"."id" ASC LIMIT 1
---
    def set_admin_profile
      @admin_profile = Admin::Profile.find(params[:id])