app/controllers/admin/projects_controller.rb

	def index
		@admin_journals = Admin::Journal.order("admin_journals.created_at DESC").paginate(:page => params[:page], :per_page => 20).is_allowed(session[:session_admin],nil)
---
SELECT "admin_journals".* FROM "admin_journals" WHERE (id IN (36)) LIMIT 20
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "admin_journals" WHERE (id IN (36)) LIMIT 20) subquery_for_count