app/controllers/admin/registrations_controller.rb

	def create
	    super
	    if @admin.save
	    	profile = Admin::Profile.create(admin_id: @admin.id, e_mail: @admin.email,name: 'unknow',last_name: 'unknow',motto: 'unknow',describe_me: 'unknow',birthday:Date.today, facebook:'unknow')
---
INSERT INTO "admins" ("created_at", "email", "encrypted_password", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
UPDATE "admins" SET "last_sign_in_at" = $1, "current_sign_in_at" = $2, "last_sign_in_ip" = $3, "current_sign_in_ip" = $4, "sign_in_count" = $5, "updated_at" = $6 WHERE "admins"."id" = 5
INSERT INTO "admin_profiles" ("admin_id", "birthday", "created_at", "describe_me", "e_mail", "facebook", "last_name", "motto", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"