app/controllers/dashboard/home_controller.rb

  def show
       @status = "Article"
  	@article = Article.find(params[:id])
  	@article_comments = Dashboard::Comment.where("article_id = ? ", params[:id]).order("id DESC")
       @similiar_articles = Article.where("(category_id = ? OR sub_category_id = ?) AND id NOT IN (?)", @article.category_id, @article.sub_category_id, params[:id]).limit(4).order("id DESC");
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", "3"]]
SELECT "admin_sub_categories".* FROM "admin_sub_categories" WHERE "admin_sub_categories"."category_id" = $1  [["category_id", 1]]
SELECT "articles".* FROM "articles" WHERE ((category_id = 1 OR sub_category_id = 1) AND id NOT IN ('3')) ORDER BY id DESC LIMIT 4

  def search_articles
    @articles = Article.where("LOWER(title) like '%#{params[:title]}%'").order("created_at DESC").paginate(:page => params[:page], :per_page => 5  )
---
SELECT "articles".* FROM "articles" WHERE (LOWER(title) like '%pertama%') ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "articles" WHERE (LOWER(title) like '%pertama%')