app/controllers/dashboard/home_controller.rb

SELECT "articles".* FROM "articles" ORDER BY created_at DESC LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM "articles"
---
  def index
  	@articles = Article.order("created_at DESC").paginate(:page => params[:page], :per_page => 3)