app/views/dashboard/comments/_index.html.erb

		<nav class="clearfix"></nav>
		<% dashboard_comment.reply_comments.each do |reply| %>
---
SELECT "dashboard_reply_comments".* FROM "dashboard_reply_comments" WHERE "dashboard_reply_comments"."comment_id" = $1  [["comment_id", 39]]