app/views/admin/profiles/details/_detail_2.html.erb

SELECT "admin_profile_skills".* FROM "admin_profile_skills" WHERE "admin_profile_skills"."profile_id" = $1 ORDER BY name ASC  [["profile_id", 1]]
---
<% @admin_profile.profile_skills.order("name ASC").each do |skill| %>