app/views/admin/profiles/details/_detail_3.html.erb

<ol class="hobby">
      <% @admin_profile.profile_hobbies.each do |hobby| %>
---
SELECT "admin_profile_hobbies".* FROM "admin_profile_hobbies" WHERE "admin_profile_hobbies"."profile_id" = $1  [["profile_id", 1]]