app/views/admin/journal_issues/_form.html.erb

                                                    <span class="clearfix"></span>
                                                    <% @admin_journal_issue.journal_issue_images.each do |image| %>
---
SELECT "admin_journal_issue_images".* FROM "admin_journal_issue_images" WHERE "admin_journal_issue_images"."journal_issue_id" = $1  [["journal_issue_id", 11]]
SELECT "admin_journal_issues".* FROM "admin_journal_issues" ORDER BY "admin_journal_issues"."id" DESC LIMIT 1

                                                  <span class="clearfix"></span>
                                                  <% @admin_journal_issue.journal_issue_files.each do |file| %>
---
SELECT "admin_journal_issue_files".* FROM "admin_journal_issue_files" WHERE "admin_journal_issue_files"."journal_issue_id" = $1  [["journal_issue_id", 11]]