app/views/dashboard/shared/_footer.html.erb

SELECT "admin_company_profiles".* FROM "admin_company_profiles" ORDER BY "admin_company_profiles"."id" DESC LIMIT 1
---
        </div> <!-- end of templatemo_footer -->
  <center>&copy;<strong><%= link_to Admin::CompanyProfile.last.name, new_admin_session_path %></strong>