app/views/dashboard/shared/_sidebar.html.erb

        <ul class="sub_side_menu">
          <% category.sub_categories.each do |sub_category| %>
---
SELECT "admin_sub_categories".* FROM "admin_sub_categories" WHERE "admin_sub_categories"."category_id" = $1  [["category_id", 1]]